; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	infrared3 - mode
	image2 - mode
	spectrograph4 - mode
	image6 - mode
	infrared0 - mode
	image5 - mode
	spectrograph7 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	Star3 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 spectrograph7)
	(supports instrument0 infrared0)
	(supports instrument0 image6)
	(supports instrument0 spectrograph4)
	(supports instrument0 image2)
	(supports instrument0 infrared3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Star10 spectrograph4)
	(have_image Star10 infrared0)
	(have_image Star11 infrared3)
	(have_image Phenomenon12 infrared3)
	(have_image Star13 image5)
	(have_image Star14 infrared0)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite0 star3 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star3)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 star13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star13)
   goals met: 0 of 8
5. (take_image satellite0 star13 instrument0 image5)
   added: (have_image star13 image5)
   goals met: 1 of 8
6. (turn_to satellite0 star11 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star11)
   goals met: 1 of 8
7. (take_image satellite0 star11 instrument0 infrared3)
   added: (have_image star11 infrared3)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon12 instrument0 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 3 of 8
10. (turn_to satellite0 star14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star14)
   goals met: 3 of 8
11. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 4 of 8
12. (take_image satellite0 star14 instrument0 infrared1)
   added: (have_image star14 infrared1)
   goals met: 5 of 8
13. (turn_to satellite0 star10 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star10)
   goals met: 6 of 8
14. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 8
15. (take_image satellite0 star10 instrument0 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 8 of 8
